Revit 2027 API
BuiltInFailures.JoinElementsFailures.JoiningDisjointWarn Property
 Highlighted elements are joined but do not intersect.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId JoiningDisjointWarn { get; }
Public Shared ReadOnly Property JoiningDisjointWarn As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ JoiningDisjointWarn {
	FailureDefinitionId^ get ();
}
static member JoiningDisjointWarn : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.JoinElementsFailures Class
Autodesk.Revit.DB Namespace